presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Haskell</title>
<meta name="author" content="K. Chousos, K. Kordolaimis, P. Seitanidis, A. Tsitsoli"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/simple.css" id="theme"/>

<link rel="stylesheet" href="/home/kchou/.config/emacs/HTML/worg.css"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1>Haskell</h1> <h4>K31 Compilers, Spring 2023</h4> <br> <p>K. Chousos, K. Kordolaimis, P. Seitanidis, A. Tsitsoli</p>
</section>

<section>
<section id="slide-org6d35f37" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h2 id="org6d35f37">Introduction</h2>
<div class="outline-text-2" id="text-org6d35f37">
</div>
</section>
<section id="slide-org2bccf82" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="org2bccf82">Raison d&rsquo;être</h3>
<ul>
<li>Haskell was created by a committee that was formed in the FPCA conference of 1987.</li>
<li>Its purpose was to unite the functional programming world by being a language that is:
<ul>
<li>Accessible (open-source)</li>
<li>Stable</li>
<li>Disruptive</li>
<li>Useful for teaching, research, as well for real-world applications</li>

</ul></li>

</ul>

</section>
<section id="slide-org4d99fe2" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="org4d99fe2">Where it is used</h3>
<p>
Haskell is used in a plethora of fields and industries to solve a variety of problems. For example:
</p>
<ul>
<li>The Cardano blockchain platform, its protocol and its smart contract infrastructure</li>
<li>In Facebook for filtering spam.</li>
<li>Hasura, an open-source real-time GraphQL engine is written in Haskell.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgf210909" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h2 id="orgf210909">Features</h2>
<div class="outline-text-2" id="text-orgf210909">
</div>
</section>
<section id="slide-orga511a52" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="orga511a52">Laziness</h3>
<ul>
<li>A very distinctive feature of Haskell is <i>Lazy evaluation</i>.</li>
<li>Its usefulness lies in the fact that it delays the computation of an expression until the value of the computation is needed.</li>
<li>The efficiency of this operation provides the reduction of unnecessary calculations alongside the saving of time.</li>
<li>The downside of this process is that the usage of memory can be unpredictable.</li>

</ul>

</section>
<section id="slide-orgd39736f" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="orgd39736f">Lambdas</h3>
<p>
Lambda expressions are a way of defining an anonymous function, helping developers define functions &ldquo;on the fly&rdquo; and passing them directly as arguments to other functions.
</p>

<div class="org-src-container">
<label class="org-src-name">Syntax of lambda expressions:</label>
<pre  class="src src-haskell"   ><code trim><span style="color: #005077;">\</span>arg1 arg2 <span style="color: #005077;">...</span> argN <span style="color: #005077;">-&gt;</span> body
<span style="color: #505050;">-- </span><span style="color: #505050;">Example: Lambda that adds two numbers</span>
<span style="color: #005077;">\</span>x y <span style="color: #005077;">-&gt;</span> x <span style="color: #005077;">+</span> y
</code></pre>
</div>

</section>
<section id="slide-orge0e8026" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="orge0e8026">Monads</h3>
<ul>
<li>Monads allow you to express complex computations in a modular way, granting the ability to represent computations as <b>sequences of steps</b>.</li>

<li>It is a type class that defines two operations: <code>return</code> and <code>&gt;&gt;=</code>.
<ul>
<li>The return operation takes a value and puts it in a monad, lifting a <b>pure value</b> into a <b>monadic context</b>.</li>
<li>The <code>&gt;&gt;=</code> operation is employed to connect monadic computations together.</li>

</ul></li>

</ul>

</section>
<section id="slide-orge0e8026-split" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">

<h3>Monads</h3>

<div class="org-src-container">
<label class="org-src-name">How I/O operations are preformed in Haskell:</label>
<pre  class="src src-haskell"   ><code trim><span style="color: #752f50;">main</span> <span style="color: #005077;">::</span> <span style="color: #354f6f;">IO</span> <span style="color: #000000;">()</span>
<span style="color: #752f50;">main</span> <span style="color: #005077;">=</span> <span style="color: #55348e;">do</span>
    putStrLn <span style="color: #0f3d8c;">"What is your name ?"</span>
    name <span style="color: #005077;">&lt;-</span> getLine
    putStrLn <span style="color: #000000;">(</span><span style="color: #0f3d8c;">"Hello, "</span> <span style="color: #005077;">++</span> name <span style="color: #005077;">++</span> <span style="color: #0f3d8c;">"!"</span><span style="color: #000000;">)</span>
</code></pre>
</div>

</section>
<section id="slide-org509aeb3" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="org509aeb3">Memory management</h3>
<ul>
<li>Haskell&rsquo;s <code>ghc</code> implementation uses a parallel generational-copying garbage collector. That means that all memory allocations and releases happen in the background automatically.</li>
<li>In every step, Haskell&rsquo;s GC searches for any <i>live data</i>: Data pointed to by the <i>roots</i> (the stack and any global variables).</li>
<li>The live data found are copied to a new heap; Any <i>dead</i> data is discarded.</li>

</ul>

</section>
<section id="slide-org04cec8f" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="org04cec8f">Prelude</h3>
<p>
Haskell&rsquo;s API is represented by its <i>Prelude</i>, a structure which holds a set of standard definitions and is included automatically in all of Haskell&rsquo;s modules. The definitions include:
</p>

<ul>
<li>Functions: <code>map</code>, <code>filter</code>, <code>read</code></li>
<li>Data Types: <code>Int</code>, <code>Bool</code>, <code>Char</code></li>
<li>Type Classes: <code>Eq</code>, <code>Read</code>, <code>Num</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-org56fa386" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h2 id="org56fa386">Example code</h2>
<div class="outline-text-2" id="text-org56fa386">
</div>
</section>
<section id="slide-org9bc46ae" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h3 id="org9bc46ae">Factorial</h3>
<ul>
<li>Here&rsquo;s a small program that computes the factorial of a given number recursively.</li>

</ul>

<div class="org-src-container">

<pre  class="src src-haskell"   ><code trim><span style="color: #752f50;">factorial</span> <span style="color: #005077;">::</span> <span style="color: #354f6f;">Int</span> <span style="color: #005077;">-&gt;</span> <span style="color: #354f6f;">Int</span>
<span style="color: #752f50;">factorial</span> 0 <span style="color: #005077;">=</span> 1
<span style="color: #752f50;">factorial</span> n <span style="color: #005077;">=</span> n <span style="color: #005077;">*</span> factorial <span style="color: #000000;">(</span>n <span style="color: #005077;">-</span> 1<span style="color: #000000;">)</span>
</code></pre>
</div>

<ul>
<li>Here&rsquo;s a program that does the same thing by leveraging <i>lambdas</i>.</li>

</ul>

<div class="org-src-container">

<pre  class="src src-haskell"   ><code trim><span style="color: #752f50;">factorial</span> n <span style="color: #005077;">=</span> product <span style="color: #000000;">[</span>1<span style="color: #005077;">..</span>n<span style="color: #000000;">]</span> 
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org7d5c212" data-background="https://global-uploads.webflow.com/6047a9e35e5dc54ac86ddd90/63064c5652d40eda2eb7a838_33ac2334.png" data-background-size="100px" data-background-position="bottom left">
<h2 id="org7d5c212">Thank you!</h2>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom/zoom.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealMarkdown, RevealZoom, RevealNotes],
slideNumber:true, center:true, width: 960, height: 700
});

</script>
</body>
</html>
